assignment03.tex
% Created 2019-01-01 Tue 20:26
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Nathan Hitchings}
\date{\today}
\title{Assignment 3 Solutions}
\hypersetup{
 pdfauthor={Nathan Hitchings},
 pdftitle={Assignment 3 Solutions},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.14)},
 pdflang={English}}
\begin{document}

\maketitle
These solutions are incomplete
\section{Exercise 1.14}
\label{sec:org9e556a5}
Draw the tree illustrating the process generated by the \texttt{count-change}
procedure of Section 1.2.2 in making change for 11 cents. What are the orders
of the space and number of steps used by this process as the amount to be
changed increases?
\subsection{Solution}
\label{sec:org9cbae5a}
This is the tree illustrating the process generated by \texttt{count-change}:
\begin{verbatim}
(count-change 11)
|
(cc 11 5)__
|          \
(cc 11 4)   (cc -39 5)
|       \___
|           \
(cc 11 3)   (cc -14 4)
|       \_______________________________________________________
|                                                               \
(cc 11 2)                                                      (cc 1 3)
|       \_________________________                              |     \__
|                                 \                             |        \
(cc 11 1)                        (cc 6 2)                      (cc 1 2) (cc -9 2)
|       \___                      |     \__                     |     \__
|           \                     |        \                    |        \
(cc 11 0)   (cc 10 1)            (cc 6 1) (cc 1 2)             (cc 1 1) (cc -4 2)
         __/ |                 __/ |       |     \__            |     \__
        /    |                /    |       |        \           |        \
(cc 10 0)   (cc 9 1)  (cc 6 0)   (cc 5 1) (cc 1 1) (cc -4 2)   (cc 1 0) (cc 0 1)
         __/ |                 __/ |       |     \__
        /    |                /    |       |        \
(cc 9 0)    (cc 8 1)  (cc 5 0)   (cc 4 1) (cc 1 0) (cc 0 1)
         __/ |                 __/ |
        /    |                /    |
(cc 8 0)    (cc 7 1)  (cc 4 0)   (cc 3 1)
         __/ |                 __/ |
        /    |                /    |
(cc 7 0)    (cc 6 1)  (cc 3 0)   (cc 2 1)
         __/ |                 __/ |
        /    |                /    |
(cc 6 0)    (cc 5 1)  (cc 2 0)   (cc 1 1)
         __/ |                 __/ |
        /    |                /    |
(cc 5 0)    (cc 4 1)  (cc 1 0)   (cc 0 1)
         __/ |
        /    |
(cc 4 0)    (cc 3 1)
         __/ |
        /    |
(cc 3 0)    (cc 2 1)
         __/ |
        /    |
(cc 2 0)    (cc 1 1)
         __/ |
        /    |
(cc 1 0)    (cc 0 1)
\end{verbatim}
Let \emph{a} be the amount to be changed, then the space complexity is \(\Theta(a)\) while the time complexity is \(\Theta(a^5)\).
\section{Exercise 1.15}
\label{sec:orgbe089cd}
The sine of an angle (specified in radians) can be computed by making use of
the approximation \(\sin x \approx x\) if \emph{x} is sufficiently small, and the
trigonometric identity
\begin{equation}
\sin x = 3 \sin (x/3) - 4 \sin^3 (x/3)
\end{equation}
to reduce the size of the argument of sin. (For purposes of this exercise an
angle is considered ``sufficiently small'' if its magnitude is not greater
than 0.1 radians.) These ideas are incorporated in the following procedures:
\begin{verbatim}
(define (cube x) (* x x x))
(define (p x) (- (* 3 x) (* 4 (cube x))))
(define (sine angle)
  (if (not (> (abs angle) 0.1))
      angle
      (p (sine (/ angle 3.0)))))
\end{verbatim}
\begin{enumerate}
\item How many times is the procedure \texttt{p} applied when \texttt{(sine 12.15)} is
evaluated?
\texttt{p} is applied 5 times.
\item What is the order of growth in space and number of steps (as a function of
\emph{a}) used by the process generated by the \texttt{sine} procedure when \texttt{(sine a)}
is evaluated?
\end{enumerate}
\end{document}